Tekla.Structures.Model.CylindricalSurface
The CylindricalSurface class defines a cylindrical surface contour.

Tekla.Structures.Model.CylindricalSurface.Radius
Gets radius of the cylindrical surface.

Tekla.Structures.Model.CylindricalSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Initializes a new instance of the Tekla.Structures.Model.CylindricalSurface class with given parameters.
The boundaries are defined by the side boundaries (i.e. generator lines of the cylinder).
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1: The first end face normal.
endFaceNormal2: The second end face normal.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.
Throws System.ArgumentNullException: Throws exception if one of the arguments has null value.

Tekla.Structures.Model.CylindricalSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Initializes a new instance of the Tekla.Structures.Model.CylindricalSurface class with given parameters.
The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cylinder).
The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1:  The first end face normal.
endFaceNormal2:  The second end face normal.
lateralBoundary1:  The first lateral boundary
lateralBoundary2:  The second lateral boundary
Throws System.ArgumentNullException:  Throws an exception if one of the arguments is null.
Throws System.ArgumentException:  Throws this exception if the boundaries are invalid.

Tekla.Structures.Model.CylindricalSurface.#ctor(Tekla.Structures.Geometry3d.Arc,System.Double)
Initializes a new instance of the Tekla.Structures.Model.CylindricalSurface class from a base arc and a height.
This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
baseArc: Arc to form the base of the bend surface
height: Height of the surface measured along the normal of the arc, may be positive or
negative, but always nonzero
Throws System.ArgumentException: Thrown if the given lengths are invalid

Tekla.Structures.Model.CylindricalSurface.#ctor(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Vector)
Initializes a new instance of the Tekla.Structures.Model.CylindricalSurface class from the cone lateral boundaries and the center line.
This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
lateralBoundary1: The first lateral boundary.
lateralBoundary2: The second lateral boundary
centerLine: The center line of the cone/cylinder
rotationAxis:
A vector normal to the circular cross sections of the cylinder. It defines the rotation axis from the
start of a lateral boundary to the end of the same lateral boundary, according to the right hand rule.